Основные_объекты_Занятие_6/src/Documents/ПриказОПриеме/ПриказОПриеме.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПриказОПриеме</name>
  <attributes>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </attributes>
  <attributes>
    <name>Должность</name>
    <type>
      <types>CatalogRef.Должности</types>
    </type>
  </attributes>
  <attributes>
    <name>СтавкаОклада</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:Document>

Основные_объекты_Занятие_6/src/Documents/ПриказОПриеме/ObjectModule.bsl
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	//--ДЗ 1.5.3 -----
	Если Сотрудник.Родитель = Справочники.Сотрудники.Неприкасаемые Тогда
	
		Отказ = Истина;
	
	КонецЕсли;
	

КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	
	СправочникОбъект =  Сотрудник.ПолучитьОбъект();
	
	//СправочникОбъект.Родитель = Справочники.Сотрудники.НайтиПоНаименованию("Работающие");
	СправочникОбъект.Родитель = Справочники.Сотрудники.Принятые;
	
	СправочникОбъект.Записать();
	
	//ДЗ 1.5.7
	СтрокаДолжность = Подразделение.Должности.Найти(Должность,"Должность");
	
	Если СтрокаДолжность = Неопределено Тогда
		
		Сообщить("В подразделении " + Подразделение + " нет такой должности " + Должность);
		Сообщить("Нельзя провести такой документ!");
		
		Возврат;
		
	КонецЕсли;
	
	Если СтавкаОклада > Должность.СтавкаОклада Тогда
		
		Сообщить("Ставка оклада по документу превышает ставку оклада должности!");
		
	КонецЕсли;
	
КонецПроцедуры


Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)

	Если ТипЗнч(ДанныеЗаполнения) = Тип("СправочникСсылка.Сотрудники") Тогда

		Должность = ДанныеЗаполнения.Должность;
		Подразделение = ДанныеЗаполнения.Подразделение;
		Сотрудник = ДанныеЗаполнения;
		
	КонецЕсли;

КонецПроцедуры
